workspace/КомиссионнаяТорговля/src/Documents/РасходДенег/РасходДенег.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РасходДенег</name>
  <registerRecords>AccumulationRegister.Продажи</registerRecords>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаПоДокументу</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокНоменклатуры</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Договор</name>
      <type>
        <types>CatalogRef.Договоры</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаКомитенту</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаВыплаты</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

workspace/КомиссионнаяТорговля/src/AccumulationRegisters/Продажи/Продажи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Продажи</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаВыплаты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Договор</name>
    <type>
      <types>CatalogRef.Договоры</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

workspace/КомиссионнаяТорговля/src/Documents/РасходДенег/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	
	Движения.Продажи.Записать();
		
	// 1. Получение данных
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РасходДенегСписокНоменклатуры.Номенклатура КАК Номенклатура,
		|	РасходДенегСписокНоменклатуры.Договор КАК Договор,
		|	СУММА(РасходДенегСписокНоменклатуры.Количество) КАК Количество,
		|	СУММА(РасходДенегСписокНоменклатуры.Сумма) КАК Сумма,
		|	СУММА(РасходДенегСписокНоменклатуры.СуммаВыплаты) КАК СуммаВыплаты
		|ИЗ
		|	Документ.РасходДенег.СписокНоменклатуры КАК РасходДенегСписокНоменклатуры
		|ГДЕ
		|	РасходДенегСписокНоменклатуры.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	РасходДенегСписокНоменклатуры.Номенклатура,
		|	РасходДенегСписокНоменклатуры.Договор";
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	// 2. Формирование набора записей
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Движение = Движения.Продажи.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Организация = Организация;
		Движение.Номенклатура = ВыборкаДетальныеЗаписи.Номенклатура;
		Движение.Договор = ВыборкаДетальныеЗаписи.Договор;
		Движение.Количество = ВыборкаДетальныеЗаписи.Количество;
		Движение.Сумма = ВыборкаДетальныеЗаписи.Сумма;
		Движение.СуммаВыплаты = ВыборкаДетальныеЗаписи.СуммаВыплаты;
		
	КонецЦикла; 
	
	// 3. Установка блокировок
	// 4. Запись всех наборов
	Движения.Продажи.Записывать = Истина;
	Движения.Продажи.БлокироватьДляИзменения = Истина;
	Движения.Записать();
	
	// 5. Контроль данных
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПродажиОстатки.Номенклатура КАК Номенклатура,
		|	ПродажиОстатки.Договор КАК Договор,
		|	ПродажиОстатки.КоличествоОстаток КАК КоличествоОстаток,
		|	ПродажиОстатки.СуммаОстаток КАК СуммаОстаток,
		|	ПродажиОстатки.СуммаВыплатыОстаток КАК СуммаВыплатыОстаток
		|ИЗ
		|	РегистрНакопления.Продажи.Остатки(
		|			&Момент,
		|			Организация = &Организация
		|			И (Номенклатура, Договор) В
		|				(ВЫБРАТЬ
		|					ВТТовары.Номенклатура КАК Номенклатура,
		|					ВТТовары.Договор КАК Договор
		|				ИЗ
		|					ВТТовары КАК ВТТовары)) КАК ПродажиОстатки
		|ГДЕ
		|	(ПродажиОстатки.КоличествоОстаток < 0
		|			ИЛИ ПродажиОстатки.СуммаОстаток < 0)";
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Момент", МоментВремени());
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Если ВыборкаДетальныеЗаписи.КоличествоОстаток < 0 Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "По номенклатуре " + ВыборкаДетальныеЗаписи.НоменклатураПредставление + 
					" не отчитались перед комитентом за меньшее количество, чем в документе, на: " + (-ВыборкаДетальныеЗаписи.КоличествоОстаток);
			Сообщение.Сообщить();
			Отказ = Истина;
		КонецЕсли;
		
		Если ВыборкаДетальныеЗаписи.СуммаОстаток < 0 Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "По номенклатуре " + ВыборкаДетальныеЗаписи.НоменклатураПредставление + 
					" не отчитались перед комитентом за меньшеую стоимость товара, чем в документе, на: " + (-ВыборкаДетальныеЗаписи.СуммаОстаток);
			Сообщение.Сообщить();
			Отказ = Истина;
		КонецЕсли;
		
	КонецЦикла;
		
КонецПроцедуры
